//var arrMoonCake = Array(


/*
var arrKrathong = Array(
  [0, 'กระทง#1'],
  [1, 'กระทง#2'],
  [2, 'กระทง#3'],
  [3, 'กระทง#4'],
  [4, 'กระทง#5'],
  [5, 'กระทง#6'],
  [6, 'กระทง#7'],
  [7, 'กระทง#8'],
  [8, 'กระทง#9']
  [0, 'map-0.jpg'],
  [1, 'map-1.jpg'],
  [2, 'map-2.jpg'],
  [3, 'map-3.jpg'],
  [4, 'map-4.jpg'],
  [5, 'map-5.jpg'],
  [6, 'map-6.jpg']
);
var arrPerson = Array(
  [0, 'ชาย'],
  [1, 'ชาย'],
  [2, 'ชาย'],
  [3, 'ชาย'],
  [4, 'ชาย'],
  [5, 'หญิง'],
  [6, 'หญิง'],
  [7, 'หญิง'],
  [8, 'หญิง']
);

var arrMap = Array(
  [0, 'map-0.jpg'],
  [1, 'map-1.jpg'],
  [2, 'map-2.jpg'],
  [3, 'map-3.jpg'],
  [4, 'map-4.jpg'],
  [5, 'map-5.jpg'],
  [6, 'map-6.jpg'],
  [7, 'map-7.jpg'],
  [8, 'map-8.jpg']

);

*/

var arrTextMemo = Array(
  [0, '1', 'คำทำนายที่หนึ่ง เซียมซีใบนี้ว่าด้วย ช่วงนี้ชะตาชีวิตเปรียบเหมือนแสงพระอาทิตย์อันแรงกล้า ทำการสิ่งใดไม่มีอุปสรรค ถ้าเจ็บป่วยจะมีหมอดีมารักษา เงินทองไม่ขัดสนการงานก้าวหน้าสรรพสิ่งดีนักแล'],
  [1, '2', 'คำทำนายที่สอง เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ไม่มีอุปสรรค จะได้โชคลาภอันพึงประสงค์ การงานเจริญรุ่งเรือง ถ้าเจ็บป่วยจะมีหมอดีมารักษา เนื้อคู่ยังอยู่ไกลทุกอย่างดีนักแล'],
  [2, '3', 'คำทำนายที่สาม เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ อาจมีอุปสรรคอยู่บ้างเล็กน้อย จงไหว้พระขอพรสิ่งร้ายจะกลับกลายเป็นดี ถามเรื่องการงานแลเชื่อเสียงช่วงนี้ยังดีอยู่ โรคภัยไม่มี โชคลาภมีน้อย เนื้อคู่จะช่วยท่านสร้างชื่อเสียงได้'],
  [3, '4', 'คำทำนายที่สี่ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะมีโชคลาภ การงานรุ่งเรือง ถ้าเจ็บป่วยจะมีหมอดีมารักษา ครอบครัวและตัวท่านจะประสบสุขตลอดกาลดีนักแล'],
  [4, '5', 'คำทำนายที่ห้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ยังไม่ราบรื่น การงานมีอุปสรรค ท่านจะเจ็บไข้ได้ป่วยความรักไม่สดชื่น โชคลาภยังไม่มี จงหมั่นไหว้พระ และขอพร วสิ่งร้ายก็จะทุเลาลงบ้าง'],
  [5, '6', 'คำทำนายที่หก เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะพบคนที่มีบุญมาช่วยเหลือ การงานก้าวหน้า เงินทองคล่องตัว ความรักจะพบเนื้อคู่ เจ็บป่วยไม่มี ทุกสิ่งทุกอย่างสมประสงค์ดีนักแล'],
  [6, '7', 'คำทำนายที่เจ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะได้ลาภ ผ้าผ่อน เงินทอง การงานไม่มีอุปสรรค แลจะได้ที่อยู่กันอันพึงใจ ความรักสดชื่น เจ็บป่วยจะมีหมอดีมารักษา มิฉะนั้นจะได้รับความสุขอย่างประเสริฐยิ่งแล'],
  [7, '8', 'คำทำนายที่แปด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะมีลาภ การงานจะรุ่งเรือง เจ็บป่วยจะหมายเร็ว เงินทองไหลมาเทมา สรรพสิ่งสมดังปรารถนาทุกประการดีนักแล'],
  [8, '9', 'คำทำนายที่เก้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะได้ยศฐาบรรดาศักดิ์ และสรรพสิ่งลาภจะบริบูรณ์ด้วยทรัพย์สมบัติ การงานเจริญรุ่งเรือง ไม่มีโรคภัยอันตราย ความรักสมหวัง สรรพสิ่งไม่มีอุปสรรคดีนักแล'],
  [9, '1 0', 'คำทำนายที่สิบ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตในช่วงนี้จะได้รับความเดือดร้อนด้วยถ้อยคำอันมิชอบจากผู้อื่น และควรระวังอันตรายจากการขับขี่ต่าง ๆ การงานมีอุปสรรคนิดหน่อย โชคลาภยังไม่มี ความรักมีอุปสรรคมาก จงหมั่นไหว้ขอพร สิ่งร้ายอาจกลายเป็นดี'],
  [10, '1 1', 'คำทำนายที่สิบเอ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตในช่วงนี้จะเกิดถ้วยความให้เกรงสตรีเป็นศัตรูจงหนัก มิฉะนั้นจะถูกฟ้องหาเพราะชู้เมีย ไม่ควรเดินทางกลางคืน การงานไม่มีอุปสรรค อาจจะเจ็บป่วยเสียงเงินทอง จึงควรไหว้พระให้ท่านคุ้มครองสิ่งต่าง ๆ อาจกลายเป็นดี'],
  [11, '1 2', 'คำทำนายที่สิบสอง เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภยศบริบูรณ์สมประสงค์ ทั้งจะอายุยืนยาว การค้าขายเจริญรุ่งเรือง จะมีเนื้อคู่อันประเสริฐ ทุกสิ่งที่ท่านขอจะสมประสงค์ดีนักแล'],
  [12, '1 3', 'คำทำนายที่สิบสาม เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้คนมีบุญมาอุ้มส่งและคุ้มครอง ถ้าเป็นความจะชนะความ การงานไม่มีอุปสรรค เจ็บป่วยจะมีหมอดีมารักษา ความรักเบิกบาน ถ้าเป็นนักเรียนควรตั้งใจศึกษา อนาคตจะรุ่งเรืองดีนักแล'],
  [13, '1 4', 'คำทำนายที่สิบสี่ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะอันตรายถึงชีวิต ท่านควรจะไปไหว้ (แปะกง) และขอพรจากท่านแล้วทุกอย่างจะดีขึ้น การงานไม่มีอุปสรรค ครอบครัว อยู่เย็นเป็นสุข ตัวท่านอาจจะเจ็บป่วยได้ในช่วงนี้ จึงหมั่นขอพรไหว้พระให้มาก ๆ สิ่งร้ายอาจจะกลายเป็นดี'],
  [14, '1 5', 'คำทำนายที่สิบห้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้แก้วแหวนเงินทอง สรรพสิ่งสมดังใจหมาย การค้าขายรุ่งเรือง ถ้าเจ็บป่วยจะมีหมอดีมารักษา เนื้อคู่เป็นผู้มีบุญ ทุกสิ่งสมประสงค์ ดีนักแล'],
  [15, '1 6', 'คำทำนายที่สิบหก เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภ ผ้าผ่อน สรรพสิ่งทั้งศัตรูจะคิดร้ายมิได้ การค้าขายไม่มีอุปสรรค โรคภัยไม่มี เนื้อคู่นั้นอยู่ไกลเวลานี้ มิฉะนั้นจะมีผู้มีบุญมาคุ้มครองดีนักแล'],
  [16, '1 7', 'คำทำนายที่สิบเจ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้พึ่งผู้สูงอายุหรือผู้มียศฐาบรรดาศักดิ์ และลาภยศกาล สรรพสิ่งสมประสงค์ การงานก้าวหน้า อายุยืนยาว มิฉะนั้นจะได้คู่ที่มีทรัพย์ดีนักแล'],
  [17, '1 8', 'คำทำนายที่สิบแปด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีลาภน้อย การค้าขายหาผล ๆ บังเกิด จะได้คู่ที่พอใจ ถ้าเจ็บป่วยหายง่าย ถ้าคบผู้ใหญ่จะมีอำนาจ ควรหมั่นไหว้พระแล้วท่านจะได้สรรพสิ่งดังใจหมาย'],
  [18, '1 9', 'คำทำนายที่สิบเก้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีความร้อนใจด้วยการเจ็บป่วย แต่ลาภผลน้อย เนื้อคู่ช่วยท่านได้ แต่ความรักอาจจะมีอุปสรรคบ้าง การงานดี ท่านควรหมั่นไหว้พระกวนอิมโพธิสัตว์ สิ่งร้ายอาจจะกลายเป็นดี'],
  [19, '2 0', 'คำทำนายที่ยี่สิบ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ ไม่มีอุปสรรค จะทำการใดก็ดีหมด การงานควรระวัง การมีปากเสียงกับผู้อื่น เจ็บป่วยไม่มี เนื้อคู่เป็นผุ้มีบุญ สรรพสิ่งสมประสงค์ดีนักแล'],
  [20, '2 1', 'คำทำนายที่ยี่สิบเอ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีโชคลาภและจะมีผู้หใญ่มาคุ้มครอง การงานเจริญรุ่งเรือง เนื้อคู่อยู่ไม่ไกล เจ็บป่วยจะหายเร็ว สรรพสิ่งสมประสงค์ แต่ควรหมั่นไหว้พระทำบุญสร้างบารมีเอาไว้บ้าง เพื่อภายหน้าลูกหลานจะได้ดี เพราะที่ทำเอาไว้'],
  [21, '2 2', 'ทำนายที่ยี่สิบสอง เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ เปรียบเหมือนต้นไม้ที่กำลังเขียวชะอุ่ม หมายถึงจะได้ลาภเงินทองไหลมาเทมา การงานจะเจริญก้าวหน้า เนื้อคู่จะเป็นผู้ช่วยให้ท่านเจริญยิ่งขึ้น เจ็บป่วยไม่มี สรรพสิ่งสมดังปรารถนาทุกประการดีนักแล'],
  [22, '2 3', 'คำทำนายที่ยี่สิบสาม เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะเกิดถ้วยความให้เกรงสตรีเป็นศัตรูจงหนัก มิฉะนั้น จะถูกฟ้องหาเพราะชู้เมีย ไม่ควรเดินทางกลางคืน การงานไม่มีอุปสรรค อาจจะเจ็บป่วยเสียเงินทอง จึงควรไหว้พระให้ท่านคุ้มครองสิ่งต่าง ๆ อาจกลายเป็นดี'],
  [23, '2 4', 'คำทำนายที่ยี่สิบสี่ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้รับความร้อนใจมิฉะนั้นอาจจะมีอันตราย การงานมีอุปสรรค เจ็บป่วยหายยาก มีบุตรเลี้ยงยาก จงหมั่นไปไหว้เทพเจ้าแห่งชะตาราศรี (ไท่ส่วย-เอี้ย) แล้วทุกสิ่งจะกลายเป็นดี'],
  [24, '2 5', 'คำทำนายที่ยี่สิบห้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ โชคลาภและอำนาจการค้าขายรุ่งเรือง เจ็บป่วยจะมีหมอดีมารักษา เนื้อคู่อยู่ด้วยกันจะประเสริฐ ท่านจะได้บุตรที่ดี สรรพสิ่งสมประสงค์ดีนักแล'],
  [25, '2 6', 'คำทำนายที่ยี่สิบหก เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีผู้มาให้โชคลาภ การงานอาจจะมีอุปสรรค เจ็บป่วยหายเร็ว ไม่ช้าจะได้เนื้อคู่ ท่านควรจะหมั่นไหว้พระและเทพเจ้าแห่งโชคลาภ (ใช้ซิ้งเอี้ย) แล้วการค้าจะดี'],
  [26, '2 7', 'คำทำนายที่ยี่สิบเจ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะเสียทรัพย์และของรัก จงระวังในการเดินทางไกล การค้าไม่มีโชคลาภ เจ็บป่วยหายยาก ท่านควรจะไปไหว้พระและขอพรจากเทพเจ้าแห่งยา (หั่วท้อเซียงซือ) แล้วสรรพสิ่งต่าง ๆ จะกลายเป็นดี'],
  [27, '2 8', 'คำทำนายที่ยี่สิบแปด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ เปรียบเหมือนพระอาทิตย์อันร้อนแรง หมายถึงการงานจะเจริญรุ่งเรือง เจ็บป่วยจะมีหมอดีมารักษา จะมีเนื้อคู่ที่พร้อมด้วยทรัพย์สมบัติ สรรพสิ่งที่ขอจะได้สมดังใจหมายแล'],
  [28, '2 9', 'คำทำนายที่ยี่สิบเก้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้จะได้ยศฐาบรรดาศักดิ์ และสรรพสิ่งลาภจะบริบูรณ์ด้วยทรัพย์สมบัติ การงานเจริญรุ่งเรือง ไม่มีโรคภัยอันตราย ความรักสมหวัง สรรพสิ่งไม่มีอุปสรรคดีนักแล'],
  [29, '3 0', 'คำทำนายที่สามสิบ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ ไม่สมดังใจหมายจะเกิดความร้อนใจ เจ็บป่วยไข้หายยาก และอาจจะเสียของรักไป ท่านควรจะหมั่นขอพรจากพระกวนอิมโพธิสัตว์และเทพเจ้าแห่งยา(หั่วท้อเซียงซือ) สิ่งร้ายจะกลายเป็นดี'],
  [30, '3 1', 'คำทำนายที่สามสิบเอ็ด เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภเพราะความฝัน จะได้ผ้าผ่อนของใช้สอยสรรพสิ่งไม่เหน็ดเหนื่อย การงานไม่มีอุปสรรค อายุยืนยาว จะมีเนื้อคู่และบุตรสุดที่รัก ถ้าเป็นความจะชนะแล'],
  [31, '3 2', 'คำทำนายที่สามสิบสอง เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จักได้ลาภแก้วแหวนเงินทอง บริบูรณ์ไปด้วยสมบัติการงานก้าวหน้า อนาคตรุ่งเรือง เนื้อคู่มีบุญ อายุยืนยาว สรรพสิ่งสมดังประสงค์ดีนักแล'],
  [32, '3 3', 'คำทำนายที่สามสิบสาม เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ เปรียบเหมือนพระอาทิตย์อันร้อนแรง หมายถึงการงานจะเจริญรุ่งเรือง เจ็บป่วยจะมีหมอดีมารักษา จะมีเนื้อคู่ที่พร้อมด้วยทรัพย์สมบัติ สรรพสิ่งที่ขอจะได้สมดังใจหมายแล'],
  [33, '3 4', 'คำทำนายที่สามสิบสี่ เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะมีการเจ็บป่วยอยู่บ้าง การค้าขายไม่คล่องตัว โชคลาภยังมีน้อย เนื้อคู่จะช่วยท่านได้ จงหมั่นไหว้พระทำบุญขอพรให้มาก ๆ จะสมปรารถนาทุกประการ'],
  [34, '3 5', 'คำทำนายที่สามสิบห้า เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ จะได้ลาภและเนื้อคู่ การงานไม่มีอุปสรรค เจ็บป่วยจะมีหมอดีมารักษา มิฉะนั้นจะมีผู้ใหญ่คุ้มครอง จงหมั่นไหว้พระขอพรจะดีนักแล'],
  [35, '3 6', 'คำทำนายที่สามสิบหก เซียมซีใบนี้ว่าด้วย ชะตาชีวิตช่วงนี้ เข้าสู่โชคลาภจะมีผู้สูงอายุมาให้โชค มิฉะนั้นจะมีเนื้อคู่พร้อมด้วยทรัพย์สมบัติ การค้าขายไม่มีอุปสรรค เจ็บป่วยจะมีหมอดีมารักษา สรรพสิ่งดังใจหมาย ถ้าเป็นความจะชนะแล']
/*
  [36, '37', ''],
  [37, '38', ''],
  [38, '39', ''],
  [39, '40', ''],
  [40, '41', ''],
  [41, '42', '']
*/
);


function Connect_DB() {
  var firebaseConfig = {
    apiKey: "AIzaSyDfTJJ425U4OY0xac6jdhtSxDeuJ-OF-lE",
    authDomain: "retailproject-6f4fc.firebaseapp.com",
    projectId: "retailproject-6f4fc",
    databaseURL: "https://file-upload-6f4fc.firebaseio.com",
    storageBucket: "retailproject-6f4fc.appspot.com",
    messagingSenderId: "653667385625",
    appId: "1:653667385625:web:a5aed08500de80839f0588",
    measurementId: "G-9SKTRHHSW9"
  };
  firebase.initializeApp(firebaseConfig);
}
